We can use the **sqlite3** package like so.

In [12]:
import sqlite3

In [13]:
conn = sqlite3.connect('data/country_club_db.sqlite')

In [14]:
cur = conn.cursor()
cur.execute('SELECT * from Facilities')

In [15]:
print(cur.fetchone())

(0, 'Tennis Court 1', 5, 25, 10000, 200)

In [16]:
print(cur.fetchall())

[(1, 'Tennis Court 2', 5, 25, 8000, 200), (2, 'Badminton Court', 0, 15.5, 4000, 50), (3, 'Table Tennis', 0, 5, 320, 10), (4, 'Massage Room 1', 9.9, 80, 4000, 3000), (5, 'Massage Room 2', 9.9, 80, 4000, 3000), (6, 'Squash Court', 3.5, 17.5, 5000, 80), (7, 'Snooker Table', 0, 5, 450, 15), (8, 'Pool Table', 0, 5, 400, 15)]

In [17]:
# Closing the DB connection
conn.close()

OR we can use the **sqlalchemy** package like so

In [23]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine('sqlite:///data/country_club_db.sqlite')

In [21]:
table_names = engine.table_names()
print(table_names)

['Bookings', 'Facilities', 'Members']

In [36]:
with engine.connect() as con:
    rs = con.execute("SELECT * FROM Facilities")
    df = pd.DataFrame(rs.fetchall())
    df.columns = rs.keys()

In [37]:
df.head()

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,2,Badminton Court,0.0,15.5,4000,50
3,3,Table Tennis,0.0,5.0,320,10
4,4,Massage Room 1,9.9,80.0,4000,3000

OR Directly with **Pandas**

In [39]:
df2 = pd.read_sql_querdf = pd.read_sql_query("SELECT * FROM Facilities", engine)
df2

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,2,Badminton Court,0.0,15.5,4000,50
3,3,Table Tennis,0.0,5.0,320,10
4,4,Massage Room 1,9.9,80.0,4000,3000
5,5,Massage Room 2,9.9,80.0,4000,3000
6,6,Squash Court,3.5,17.5,5000,80
7,7,Snooker Table,0.0,5.0,450,15
8,8,Pool Table,0.0,5.0,400,15